///******************************************************************************************
///第一步把前n-1块移到隔壁记为step[n-1]，那么n块移到隔壁step[n]=3*step[n-1]+1
///然后，将n块从第一根柱子移动到第三根柱子，相当于将上面步骤计算了两次，即输出2*step[n]
///******************************************************************************************
#include<iostream>

using namespace std;

int main()
{
    int n;
    long long  a[36]={0,1};
    for(int i=2;i<36;i++)
        a[i]=3*a[i-1]+1;
    while((cin>>n)&&n)
    {
        cout<<2*a[n]<<endl;
    }
}
